# TUAs
brew "fish"
brew "git"
brew "neovim"
brew "ripgrep"
brew "tree"
brew "starship"
brew "gh"
brew "mise"
brew "lynx"
brew "awscli"
brew "clojure/tools/clojure"
brew "borkdude/brew/clj-kondo"

# Casks
# cask "1password" Uncomment next time I install from scratch
cask "1password-cli"
cask "visual-studio-code"
cask "ghostty"
cask "claude"
cask "figma"
cask "altair-graphql-client"
cask "zen-browser"
# cask "alcove" Uncomment next time I install from scratch
cask "comfyui"
cask "temurin@21"

# Fonts
cask "font-sf-pro"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-new-york"
cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"


# Mac App Store applications via mas (use app IDs)
mas "Things 3", id: 904280696               # Things 3 (task manager)
mas "Magnet", id: 441258766                 # Magnet (window manager)
mas "iA Writer", id: 775737590              # iA Writer (writing app)
mas "Xcode", id: 497799835                  # Xcode (Apple development IDE)
mas "Endel", id: 1346247457                 # Endel (focus/sleep sounds)
mas "NordVPN", id: 905953485                # NordVPN (App Store version, if preferred)
mas "Apple Developer", id: 640199958        # Apple Developer (official Apple Developer app)
mas "1Password for Safari", id: 1569813296  # 1Password for Safari
mas "Pages", id: 409201541                  # Pages (word processor)
mas "Numbers", id: 409203825                # Numbers (spreadsheet)
mas "Klack", id: 6446206067		    # Klack (makes mechanical keyboard sounds) Might delete later
mas "Pixelmator Pro", id: 1289583905        # Pixelmator Pro (image editor)

# VSCode Extensions
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hyrious.import-cost"
vscode "jakebecker.elixir-ls"
vscode "kamikillerto.vscode-colorize"
vscode "mattpocock.ts-error-translator"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "phoenixframework.phoenix"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "tamasfe.even-better-toml"
vscode "tobermory.es6-string-html"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"

