# NOTE: To use run the following commands in the root of the dotfiles
# brew tap homebrew/bundle
# brew bundle

tap "heroku/brew"

brew "fish"
brew "git"
brew "tree"
brew "postgresql", restart_service: :changed
brew "redis", restart_service: :changed
brew "elixir"
brew "heroku"
brew "neovim"
brew "rbenv"
brew "yarn", args: ['ignore-dependencies']
brew "python"
brew "python@2"
brew "ripgrep"
brew "tmux"

# Install Cask.
tap "caskroom/cask"
# Install Mac App Store CLI.
brew 'mas'
# Install Caskroom for beta applications.
tap 'caskroom/versions'

cask_args appdir: "/Applications"

# Install Applications
mas "1Password7", id: 1333542190
mas "Things3", id: 904280696
mas "Bear", id: 1091189122
cask "iterm2"
cask "google-chrome"
cask "dropbox"
cask "sketch"
cask "numi"
cask "iina"
cask "now"
cask "ivpn"
cask "kap"
mas "Contrast", id: 1254981365
mas "iA Writer", id: 775737590
mas "Noizio", id: 928871589
mas "Slack", id: 803453959
mas "Reeder", id: 880001334
mas "xScope", id: 889428659
mas "Transmit", id: 403388562
mas "Pixelmator Pro", id: 1289583905
mas "Tweetbot", id: 1384080005
mas "LookUp", id: 965041401
mas "Newton", id: 1059655371
mas "Numbers", id: 409203825
mas "Kaleidoscope", id: 587512244
mas "WhatsApp", id: 1147396723
