tap "borkdude/brew"
tap "clojure/tools"
tap "dan-hart/tap"
tap "pointfreeco/tap"
tap "sst/tap"
brew "awscli"
brew "cloudflare-wrangler"
brew "colima"
brew "docker"
brew "docker-compose"
brew "elixir"
brew "fish"
brew "gh"
brew "git"
brew "lynx"
brew "mas"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "pnpm"
brew "starship"
brew "tree"
brew "tree-sitter-cli"
brew "borkdude/brew/clj-kondo"
brew "clojure/tools/clojure"
brew "dan-hart/tap/clings"
brew "pointfreeco/tap/pfw"
cask "1password-cli"
cask "alcove"
cask "altair-graphql-client"
cask "claude"
cask "figma"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-new-york"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "ghostty"
cask "google-chrome"
cask "sketch"
cask "soulver"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "Developer", id: 640199958
mas "Endel", id: 1346247457
mas "Flighty", id: 1358823008
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Klack", id: 6446206067
mas "Magnet", id: 441258766
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Telegram", id: 747648890
mas "Things", id: 904280696
mas "Xcode", id: 497799835
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hyrious.import-cost"
vscode "jakebecker.elixir-ls"
vscode "kamikillerto.vscode-colorize"
vscode "mattpocock.ts-error-translator"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "phoenixframework.phoenix"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "tamasfe.even-better-toml"
vscode "tobermory.es6-string-html"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
